// miniprogram/pages/enchiridion/detail/detail.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    isShowSideslip: false,

    textList: [{
      'description': "“海贝分”是威海市于2018年在全省率先推出的城市个人信用积分。全市18周岁以上的居民纳入了积分评价范围。从道德公益、守法履约、社会责任、表彰奖励、公共服务五个维度进行综合信用评价。每人原始积分1000分，加分项主要有表彰奖励、志愿服务、义务献血、慈善捐赠等; 减分项主要有党纪政纪处分、行政处罚、司法判决、偷税逃税、考试作弊以及公共服务领域的失信行为。海贝分以正向激励为主，各部门配套出台.了若干信易游、信易贷、信易医、信易借、信易购、信易行等信用惠民政策。      级别划分:        个人信用积分评价采用千分制，默认初始得分为1000分，设定为AAA、AA、A、B、C、D六个级别。      1150分以上为AAA级(诚信模范级别) ;      1050-1149分为AA级(诚信 优秀级别);    1000-1049分为A级(诚信级别);    950 - 999分为B级(较诚信级别);    801-949分为C级(诚信警示级别);    800分及以下为D级(不诚信级别) ;      赋值标准:        1、表彰奖励: 获得国家级、省部级、省市级、县级荣誉的，分别加100、60、 30、20分;      2、志愿服务: 前20个小时，每小时计1分; 21-80个小时，每2小时计1分; 81-200个小时，每3小时计1分, 201 - 500个小时，每4小时计1分;      3、见义勇为: 经有关部门认定的加40分;      4、无偿献血: 1次加10分(评价期内依次累计加分);    5、慈善捐助: 累计捐赠0.5万 - 1万(含) 计10分、累计捐赠1万-10万(含) 计20分、累计捐赠10万-50万(含)计30分、 累计捐赠50万以上计60分;      6、党纪政纪: 根据严重程度分别扣30、60、 90分; 被开除党籍、公职扣1 50分;      7、行政处罚: 因食品安全、环境保护、公共安全、城市管理、市场秩序等被公安、市场监管、税务等部门行政处罚的，按情节严重程度分别扣20、40、 60分;      8、司法失信: 失信被执行人扣200分、刑事判决扣200-300分、虚假诉讼和妨碍司法机关调查取证信息扣100分;      9、社会诚信: 考试作弊、学术造假扣60分; 骗取政府(低保、社保、救助)等资金的、被监管部门列入行业禁入的扣100分; 提供虚假证明材料, 篡改个人信用记录的扣200分;      10、公共服务: 本人明确知道拖欠水、电、暖气、住院.费、停车费的，有履行能力但拒绝履行，经过两次催缴仍未缴纳的，经相关机构认定为失信行为的、根据金额大小或拖欠时间长短，依次扣10、 20、30分。      信息安全:        实行授权评价制度，非本人或授权, 不能查询个人信用积分，不得将信用积分对外公开。      评价期限:        信用积分评价有效期限自信用行为发生或者事件终止之日起计算。良好信息评价期限为5年，失信信息评价期限为3年。    ",
      'title': "海贝分政策总览",
      'source': "信用文登",

    },]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})